; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v4)
             (pred_8 ?v5 ?v2)
             (pred_12 ?v13 ?v2)
             (pred_11 ?v1 ?v13 )
	     (pred_7 ?v13)
             (pred_1 ?v8)
             (pred_2 ?v5)
             (pred_3 ?v2)
             (pred_10 ?v13)
             (pred_5 ?v5)
             (pred_6 ?v13)
             (pred_4 ))



(:action op_2
:parameters (?v10 ?v6 ?v3 ?v7)
:precondition (and (pred_1 ?v10) (pred_1 ?v6) (pred_2 ?v3) (pred_3 ?v7)
          (pred_9 ?v10 ?v6) (pred_8 ?v3 ?v7)
                   (pred_12 ?v6 ?v7) (pred_7 ?v10) 
                   (pred_10 ?v6) (pred_5 ?v3))
:effect (and  (pred_6 ?v6) (not (pred_10 ?v6))))


(:action op_1
:parameters (?v10 ?v12)
:precondition (and (pred_1 ?v10) (pred_1 ?v12)
               (pred_7 ?v10) (pred_9 ?v10 ?v12) (pred_6 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v10))))

(:action op_5
:parameters (?v10 ?v3)
:precondition (and (pred_1 ?v10) (pred_2 ?v3) 
                  (pred_7 ?v10) (pred_11 ?v3 ?v10) (pred_4 ))
:effect (and (pred_5 ?v3)
   (not (pred_11 ?v3 ?v10)) (not (pred_4 ))))


(:action op_3
:parameters (?v10 ?v9 ?v11)
:precondition (and (pred_1 ?v10) (pred_2 ?v9) (pred_2 ?v11)
                  (pred_7 ?v10) (pred_5 ?v11) (pred_11 ?v9 ?v10))
:effect (and (pred_5 ?v9) (pred_11 ?v11 ?v10)
        (not (pred_5 ?v11)) (not (pred_11 ?v9 ?v10))))

(:action op_4
:parameters (?v10 ?v3)
:precondition (and (pred_1 ?v10) (pred_2 ?v3) 
                  (pred_7 ?v10) (pred_5 ?v3))
:effect (and (pred_4 ) (pred_11 ?v3 ?v10) (not (pred_5 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_07 obj_01 obj_06 obj_11 obj_02 obj_10 obj_09 obj_08
    obj_05 obj_12
    obj_03 obj_13
    )

    (:init
       (pred_4)

       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_12)
       (pred_2 obj_03)
       (pred_2 obj_13)

       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_02 obj_08)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_08 obj_02)
       (pred_9 obj_08 obj_09)
       (pred_10 obj_09)
       (pred_10 obj_08)
       (pred_12  obj_09 obj_05)
       (pred_12  obj_08 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_10)

       (pred_8  obj_03 obj_05)
       (pred_8  obj_13 obj_12)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_13 obj_02)
       (pred_7 obj_01)
    )

    (:goal (and
       (pred_11 obj_13 obj_10)
    ))
(:constraints
  (always (not (pred_7 obj_11)))
)
)

; plan
1. (op_1 obj_01 obj_02)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_02)
   goals met: 0 of 1
2. (op_5 obj_02 obj_13)
   deleted: (pred_11 obj_13 obj_02) (pred_4)
   added: (pred_5 obj_13)
   goals met: 0 of 1
3. (op_1 obj_02 obj_01)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_01)
   goals met: 0 of 1
4. (op_1 obj_01 obj_07)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_04)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_04)
   goals met: 0 of 1
6. (op_1 obj_04 obj_06)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_06)
   goals met: 0 of 1
7. (op_1 obj_06 obj_10)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_13)
   deleted: (pred_5 obj_13)
   added: (pred_4) (pred_11 obj_13 obj_10)
   goals met: 1 of 1
